[
{"profile_url": "https://www.compass.com/agents/hala-adra/", "first_name": "Hala", "middle_name": "", "last_name": "Adra", "image_url": "https://www.compass.com/m3/89dc0e2850bdc41948d879cb979b196eabc2cd72/300x300.jpg", "desciption": "For experienced Realtor Hala Adra, real estate is about helping every client find their way home.Hala knows that buying or selling is a transformative life milestone, and one that’s often defined numerous complexities and challenges. That’s why she works tirelessly every day to be thetrusted advisor her clients deserve, one who can help them navigate every potential roadblockto make their dreams a reality. How?  combining unrivaled local insight, creative vision, andthe compassionate drive to make a difference in the lives of her clients.Forced to flee her homeland of Beirut in 1985, Hala knows all too well how intimidating it can beto start a new chapter. Luckily, she had traveled to DC once before, and sensed she couldenvision building a life here. Her instinct proved correct, and she has called our nation’s capitalhome ever since. After a stint working for the embassy of the U.A.E, Hala made the transition toreal estate at the behest of her brother, who knew what a valued resource she could be to anybuyer or seller thanks to her impressive business acumen, deep connections within the diplomatcommunity, and love of working with people. Hala made the , and instantly knew it was hercalling to help others find their place in the DC area just as she had found hers.Today, Hala is a reputable, award-winning Associate  who brings over 25 years ofindustry experience to each transaction. She’s best known  clients for her can-do attitude,world-class service approach, and inventive problem-solving skills. Whether she’s guiding first-time buyers or seasoned sellers, Hala is a dedicated advocate for every client, always workingto find the right solutions  putting their interests first. She also offers extensive insight into theentire DMV area—from the manicured sidewalks of McLean, to the bustling streets of DC, andthe scenic pathways of Bethesda.Hala is impressively well-traveled, and has participated in many local and international realestate conferences as part of her quest to be a lifelong learner. Such exposure has empoweredher to continually uncover inventive  angles for sellers, strategically positioning each in the light that will most effectively maximize its value. And as a multilingual Realtor withenduring international ties, Hala connects buyers from across the globe with sellers in the DCarea, turning every networking opportunity into a successful sale benefiting all parties involved.Hala has recorded $250 million in sales to date, and is consistently recognized Washingtonian as a top producer year after year. Although for Hala, the results she creates forher clients are the ones that matter most. It’s no surprise, then, that her business is 90% repeatand referral-based, or that she’s built a reputation as one of the most reliable, devoted Realtorsaround.When she’s not working for her clients, you can find Hala entertaining friends, gardening,decorating, and exploring the vibrant sights of the entire DMV Metro Area. She also lovestraveling, relaxing on the beach, listening to live music, and watching shows on Broadway.Client TestimonialsScroll down for more★★★★★\"Already when we bought our home a couple of years ago, Hala assisted us in any way and went above and beyond. She sensed what we were looking for, found fantastic alternatives in the hot market of Bethesda, knew about the perfect timing, and helped us finding the home, that perfectly matched our needs. When it now was time to leave the area, we did not hesitate at all and asked Hala to sell our home for us. With her broad experience, her professionalism, her welcoming attitude and her warmhearted personality, she guided us effortlessly through the process. Excellent timing, optimal preparation, and right pricing lead to a sale with ease in no time.Hala‘s work is exceptional, she is always available, incredibly skilled, extremely supportive, trustworthy and very loyal. We recommended her many times, and will certainly continue to do so.\"- Susann Y.★★★★★\"I recently had the pleasure of working with Hala during the process of buying my first home, and I cannot express enough how grateful I am for her exceptional service and dedication. From the very beginning, Hala demonstrated a deep understanding of the real estate market and a genuine commitment to helping me find the perfect home. Hala is incredibly knowledgeable about the local market and provided invaluable insights that helped me make informed decisions. Her expertise was evident in every interaction, from the initial consultation to the final closing. She was always well-prepared, organized, and ready to answer any questions I had. Hala kept me informed at every step of the process, promptly returning calls and emails, and ensuring that I was always up-to-date with the latest developments. This level of transparency and responsiveness made the entire experience stress-free and enjoyable. What truly sets Hala apart is her genuine care and personal touch. Her warm and friendly demeanor made me feel comfortable and confident in my decisions.Thanks to Hala’s hard work and expertise, I found my dream home. The entire process was smooth and efficient, and I couldn't be happier with the outcome. Her attention to detail ensured that nothing was overlooked. In conclusion, I highly recommend Hala to anyone in need of a top-notch realtor. Her professionalism, expertise, and dedication are unmatched, and she truly goes above and beyond for her clients. Thank you, Hala, for making my dream of homeownership a reality.\"- Rima K.★★★★★\"Top notch real estate professional! Hala is a master in her field! She truly knows her stuff! What a breath of fresh air having Hala take care of selling our condo in Washington, DC in 3 days on the market, incredible!  She is extremely knowledgeable with over 25 years of experience, she is honest and transparent and had our back every step of the way.  Hala and her team truly marketed our property beautifully, the photography and content and details showcasing our property was so professionally and impressively done allowing buyers to easily appreciate the value in our property.  We love how she predicted obstacles before they happened and always was a step ahead. She noted all our concerns and presented her recommendation and truly took care of us through the entire process with her attention to detail, her expertise and knowledge in every aspect of the process.  We love how she took us through every step and predicted concerns or issues on the way before they happened and presented her knowledge and recommended best ways to handle concerns that may arise. She answers calls immediately, follows up takes control and makes things happen quickly! It was such a calm, wonderful transaction and truly such a pleasure working with Hala,  definitely a keeper and will continue to recommend her to family and friends and look forward to working with her again and again and again in the future.  Thank you Hala! From our hearts - it was truly lovely working with you!\"- Tania and Samir★★★★★\"Since buying or selling a home is a large investment, it is important to partner with the best-in-class capable broker. We have found that in Hala Adra. She helped us in two transactions, while we downsized: finding a pied-a-terre and also finding the right buyer for our house. In addition to being very professional and with a lot of knowledge in the DMV real estate market, we found Hala to be easy to work with and a very pleasant person to interact with. She is positive and enthusiastic. She is an advocate and not pushy. Above all, she is honest and transparent. She bases her recommendations on market data and presents her point of view as an ally. She then gives us time and space to ponder what she presents allowing for her point of view to simmer until it becomes our idea. She is persistent in pursuing the best approach, assessing the options, and methodically studying the risks and benefits of each. Hala is the consummate professional. She is hard working - at time taking our calls, or writing an offer, late in the evening. Although we were not an easy client, Hala never complained or changed her demeanor. She pays a lot of attention to detail and always has her antennas up for potential transaction risk (e.g. something that could derail closing, etc.). She looks after her client’s interests and ensures that each transaction is solid and virtually risk-free. We are very pleased with Hala’s results, and we highly recommend her for your real estate needs.\"- Debakey Family★★★★★\"Hala is exceptional at what she does. She has deep expertise, integrity, stellar  relationships amongst her peers and only wanted the very best for my family&I. We were new to the area and looked at so many homes over a period of months in a complex and hot market, however, we always had  the utmost confidence and solace in our agent. She went above and beyond countless times. We landed our dream home and she handled the process for us from a-z, we could not have done this without her and are so grateful for her tireless efforts and around the clock work ethic. She also led us to the very best attorney, home inspector and so on. A true professional whom we now  consider a trusted a friend that we recommend  to anyone & everyone who wants the best.\"- Omar B.★★★★★\"Hala was amazing throughout the process! she was extremely insightful, had excellent feedback and was always available. she helped us find the perfect home, lock it in in time and made the transition into the home seamless.  I have already recommended her to several friends who share my experience and will continue to do so! Thank you Hala!!!\"- Ramzi Alami.★★★★★\"Hala is a true delight. She is a consummate professional, attentive to detail, and worked hard to keep me informed at every step and to ensure my goals as a client were met. I would absolutely recommend her to anyone looking for help with a real estate transaction in the DC Metro area.\"- M Razian.★★★★★\"Hala is a true professional. She worked with us on the sale of our home while simultaneously assisting us in identifying and closing on a new property. Through it all she helped us understand the process and market conditions while guiding us through all that is required for successful completion. I would highly recommend her and would surely work with her in the future.\"- Firas Maksad.★★★★★\"I've had the opportunity to work with Hala both from a buyer's perspective at one point, as well as a seller's perspective recently. When I decided to list my property in the midst of a pandemic, I turned to her for guidance and advice. The end result was my property going under contract less than 24 hours after  it, and only 2 weeks after deciding to sell it. If you are looking for a real estate professional that consistently delivers results, I believe you'd have a great experience with Hala.\"- Abdallah A.★★★★★\"Our review and our words don't even begin to give her the credit Hala deserves. She was the most amazing agent. We began our search for a home two years ago with very particular requests. Hala was incredibly patient with us throughout the whole process, constantly taking notes, and keeping a list of our needs, and working tirelessly to find us our dream house. She consistently took hours out of her day to show us four or five houses at a time. We so appreciated how she always gave her most honest opinion of the homes we saw and kept all of our needs and desires in mind. She never once pushed us to make a decision we weren't comfortable with, and in fact, told us when she didn't think a house would be right for us. We never felt pushed or pressured. When she saw the house we ended up buying, she immediately told us we had to see it because it met every item on our list. She was supportive, extremely helpful, and professional through the offer process. She always made us feel comfortable and fought in our best interest. She is truly the best agent you can find and we wouldn't have our perfect home without her. We recommend working with her 110%.\"- May K.★★★★★\"Although I am an attourney, I was looking for a real estate professional into whose hands I could put the sale of my home and whose judgement and ethics I could trust completely. Hala was perfect and pleasant!! She gave me good advice on pricing, found a fantastic company to stage the property, and thought of and through every detail. She was a joy to work with, and I recommend her highly!! 5-stars+!\"- David M.★★★★★\"Hala Adra was amazing!! She was very knowledgable and well informed. She answered all our inquiries in a very informed manner. She also understood our requirements and used that to narrow down our search and save us time. She was also very nice and accommodating and professional at the same time. She helped find our house with the specifications that we had in mind and when we put it on the market to rent it, it rented within 2 days!! She is an excellent negotiator and she is not too pushy. I would recommend Hala Adra in a heart beat for anybody who wants to buy, sell or rent real estate. She is excellent and she did a superb job for us . She was excellent and I give her 5 stars!!!\"- Shiraz★★★★★\"Incredible service from the first time we spoke. She was always willing to answer questions day or night, and she used her experience in the DC/MD/VA area to guide our home buying. We could not have been any happier!! She was with us every step of the way, even to the time of closing. Behind the scenes, she took the time to visit various homes at different times of the day to help us get a sense of direct sunlight. I highly recommend her to anyone looking for  in the area. She always treated us like we were her only clients, and we will never forget all of her hard work to help us find the house of our dreams.\"- Jon★★★★★\"Hala helped us buy a home that we needed in zip code 22101 which as you know is currently very competitive and it is a buyers market. She helped us achieve our desired results. So we recommend Hala for your real estate needs. Hala is knowledgeable and knows the Mclean market very well.\"- Suraj★★★★★\"Hala has been a blessing to our .  Very professional and personal service. Recommended highly if you are looking for a real partner that cares about your interests. We bought and sold our  through her, she understood and clarified to us the market dynamics surrounding our home and  that helped us have smooth transactions both ways.\"- Nidal★★★★★\"Hala was very professional and knowledgable.  A real pro, very responsive and reliable.  We had used another realtor prior to finding Hala, and we are so glad we found her.  She helped us find our dream home and sell our first home.  Would highly recommend.\"- Chris​​", "social": {"linkedin": "https://www.linkedin.com/in/halaadra", "facebook": "https://www.facebook.com/halaadra/", "instagram": "https://www.instagram.com/halaadrarealestate/?hl=en"}, "email": "hala.adra@compass.com", "title": "Associate Broker  |  Realtor®", "agent_phone_numbers": ["703-980-4041", "703-310-6111"], "office_phone_numbers": ["703-310-6111"]},
{"profile_url": "https://www.compass.com/agents/koki-adasi/", "first_name": "Koki", "middle_name": "", "last_name": "Adasi", "image_url": "https://www.compass.com/m3/b639f6493e2364f9ed72445bd80f97885764a2c1.jpg", "desciption": "Meet Koki Adasi – a proud Washington, DC native, basketball enthusiast, and a real estate pro with a heart for community. Recognized as \"100 Best Agents\" by Washingtonian Magazine, Koki’s passion for family, hoops, and helping others shines through everything he does.A graduate of Magruder High School and Mount Saint Mary’s University, where he also serves on the Board of Trustees, Koki calls Chevy Chase, DC, home.For the past 20 years, he’s been a dynamic force in the DMV real estate scene, from serving as President of GCAAR in 2019, former honoree of Realtor Magazine's '30 Under 30', and leading a team that has closed nearly 1,500 transactions!When he’s not closing deals, you’ll find Koki coaching or playing basketball, working on his pickleball game, or supporting local non-profit organizations. A dedicated supporter of Horton's Kids, Koki is more than just a donor—he’s an active volunteer and proud Board member.Koki also serves on the Executive Committee for theCompass Sports & Entertainment Division. The group is composed of 170+ top agents across 75+ US markets.Koki has had the privilege of assisting countless professional athletes and has earned a reputation for confidentiality, strategy, and precision.View our website!", "social": {}, "email": "koki@compass.com", "title": "Executive Vice President | Member - Compass Sports & Entertainment Division", "agent_phone_numbers": ["240-994-3941", "301-298-1001"], "office_phone_numbers": ["301-298-1001"]},
{"profile_url": "https://www.compass.com/agents/randolph-adams/", "first_name": "Randolph", "middle_name": "", "last_name": "Adams", "image_url": "https://www.compass.com/m/13/bfd42b16-ae5f-4690-bd36-af6eead43cd5/300x300.webp", "desciption": "", "social": {}, "email": "randolph.adams@compass.com", "title": "REALTOR®", "agent_phone_numbers": ["202-656-8019", "301-298-1001"], "office_phone_numbers": ["301-298-1001"]},
{"profile_url": "https://www.compass.com/agents/dani-adams/", "first_name": "Dani", "middle_name": "", "last_name": "Adams", "image_url": "https://www.compass.com/m/13/332a9d2b-c8e4-4bd8-b4c6-c650231bb7da/300x300.webp", "desciption": "Dani is a dedicated and highly experienced realtor. She values trust and integrity above all else. With decades of customer service experience, Dani concentrates her efforts on professionalism and building long-lasting relationships with all of her clients. After several less than stellar personal real estate transactions, she realized the real estate industry needed a change and set out to do so. Today, she brings her honesty, client appreciation, and focus to the industry and strives to deliver the best experience possible to each one of her clients. Dani has had great success and gained the ability to navigate aggressive, complex, and competitive transactions. Whether working with buyers, sellers, investors, or renters, Dani delivers the highest client experience through her value and unparalleled desire to make her clients' real estate experiences the absolute best. She is relentless in her pursuit to negotiate for her clients while maintaining focus on their personal needs throughout the transaction. She takes great pleasure building a tight bond with her clients and getting to know each and every one of them. She has been recognized numerous times for her elite customer service. Dani is happily married with two young children, loves spending time with her family, working out, and traveling anywhere and everywhere! She is also a licensed REALTOR in Washington.", "social": {"facebook": "https://www.facebook.com/daniadamsrealtor/", "instagram": "https://www.instagram.com/dani.adams80/"}, "email": "dani.adams@compass.com", "title": "REALTOR®", "agent_phone_numbers": ["601-918-8235", "703-229-8935"], "office_phone_numbers": ["703-229-8935"]},
{"profile_url": "https://www.compass.com/agents/kerry-adams/", "first_name": "Kerry", "middle_name": "", "last_name": "Adams", "image_url": "https://www.compass.com/m/13/99654142-2a25-4bd6-aee1-3727f39803b1/300x300.webp", "desciption": "As a lifelong Washingtonian and a full time Realtor since 2002, Kerry has witnessed the dramatic transformation of the DC region and understands the complexities of the ever-changing real estate market. She has consistently been listed as a top agent by Washingtonian Magazine, and she ranks in the top 1.5% of agents nationwide (WJS/RealTrends).Prior to real estate, Kerry spent over a decade as a broadcast journalist - winning numerous awards including an Emmy, an AP Award, and an Edward R. Murrow.  She credits much of her success in real estate to her journalism background. Since each client has distinctly different needs, asking the right questions, doing the necessary research, and communicating clearly are the most important steps in helping buyers and sellers reach their goals.As a seasoned negotiator, she prides herself on having helped hundreds of happy clients get to the closing table.Kerry is committed to engagement and leadership in the community supporting and sponsoring many DC area charities and serving on several boards.Kerry lives in the City of Alexandria with her husband, twin daughters, and rescue dogs.Licensedin Virginia, DC, Maryland, and Delaware, she is ready to help you with any of your real estate needs in the DMV andbeyond.", "social": {"linkedin": "https://www.linkedin.com/in/kerry-adams-59604428", "instagram": "https://www.instagram.com/kerryinalexandria/?hl=en", "facebook": "https://www.facebook.com/BlumelAdams/"}, "email": "kerry.adams@compass.com", "title": "Realtor®", "agent_phone_numbers": ["703-587-7841", "703-229-8935"], "office_phone_numbers": ["703-229-8935"]},
{"profile_url": "https://www.compass.com/agents/sarah-adams/", "first_name": "Sarah", "middle_name": "", "last_name": "Adams", "image_url": "https://www.compass.com/m/13/9397494c-d4f4-4375-bd9a-a2c2a04550a7/300x300.webp", "desciption": "Sarah Adams’s background uniquely prepared her for a career in real estate. She honed her exceptional listening skills as a coach in the fitness industry, as a forensic scientist, and in the bar and restaurant business. By her mid-20s, Sarah had attained the role of vice president at a start-up fitness business, which is now a national brand. Each of these roles taught her to quickly assess a situation and understand the underlying motives driving her clients’ real estate goals. Her shrewd research skills, ability to think through every contingency and penchant for details benefit her clients, as Sarah seeks to understand their lives and advise accordingly.Sarah began her real estate career in DC as an agent on the top-ranked Mandy & David Team at Compass (now MDT Real Estate), and later served as the team's Director of Sales & Operations. In addition to her role with MDT Real Estate, Sarah also runs her own team in her hometown of Ann Arbor, Michigan. Sarah holds a bachelor's degree from Washington University in St. Louis and a master's from George Washington University.Client Testimonials★★★★★\"Sarah was hands down a delight to work with! She was thorough, patient (we had numerous neighborhood, home type and budget changes!) and fun throughout the entire home searching and buying process.\"- Zillow Reviewer★★★★★\"Sarah has been an absolute delight to work with. She is well-versed, very knowledgable and really easy to talk to. She was on top of everything throughout the entire home buying process.\"- Zillow Reviewer★★★★★\"Sarah was wonderful to work with and very attentive.  As a first time homebuyer it was great to work with a realtor who sought to understand my wants and needs\"- Zillow Reviewer★★★★★\"Thank you to Sarah and everyone on her team for being so unbelievably awesome to the point where I’m a little sad this process is over!!!\"- Zillow Reviewer★★★★★\"She was patient with us, incredibly helpful and knowledgeable and helped us get into our DREAM home at an unreal price and with a 16 day close.\"- Zillow Reviewer", "social": {}, "email": "sarah@mandyanddavid.com", "title": "Realtor® Licensed in DC & MI", "agent_phone_numbers": ["734-417-1415", "202-386-6330"], "office_phone_numbers": ["202-386-6330"]},
{"profile_url": "https://www.compass.com/agents/abrams-residential/", "first_name": "Abrams", "middle_name": "", "last_name": "Residential", "image_url": "https://www.compass.com/m/13/3a13551e-cfc7-4ae2-a7cc-da815ffc0baa/300x300.webp", "desciption": "Abrams Residential at Compass was born of the belief that you really can have it all when choosing a real estate partner. With a combined 30 years of real estate experience and as a husband and wife team raising a family in Bethesda, we have built our practice on the ideals that make working with a local, family business so special- deep subject matter expertise, exceptional service, individualized attention and a commitment to beingyour trusted real estate advisors for life.It is no wonder why 90% of our business continues to come from repeat and referral clientele.While Abrams Residential loves providing our clients with the feel of a local family business, we also understand the value that our partnership with Compass, the #1 residential real estate brokerage in the US, brings to our clients with its best in class technology, reach, resources and branding. We are proud that our efforts to create this unique combination - hyper-local and national, highly personalized and tech enabled, family and Fortune 500- has been recognized byBethesda Magazine,The WashingtonianandRealTrends/WSJAmerica's Best Real Estate Agents, for the extraordinary results that we have achieved in partnership with our clients. We look forward to having the opportunity to serve you one day and to welcome you to the Abrams Residential family.", "social": {"facebook": "https://www.facebook.com/AbramsAtCompass/", "instagram": "https://www.instagram.com/abramsresidential/"}, "email": "abramsresidential@compass.com", "title": null, "agent_phone_numbers": ["202-716-0660"], "office_phone_numbers": []},
{"profile_url": "https://www.compass.com/agents/david-abramson/", "first_name": "David", "middle_name": "", "last_name": "Abramson", "image_url": "https://www.compass.com/m2/1da1f594-5b68-48e5-93ef-8261a3e18a71", "desciption": "David has garnered an excellent reputation through hard work, client advocacy, and innovative thinking. His friendly demeanor and unwavering dedication to clients is one of the keys to his success. As a native Washingtonian, David has an unparalleled knowledge of the DC metro area.David is a leader in the real estate community by setting a new standard of service. His real estate success is attributed to his outstanding customer service, acute attention to detail and unparalleled work ethic. David uses all of his resources to ensure his client's properties are sold quickly and  maximum value.David works with buyers, sellers, investors and some of the top real estate development companies in the DC area.David has been recognized as a Top Realtor in the DC area by Washingtonian Magazine and GCAAR.  David has been featured in Bethesda Magazine, DC Metro Real Producers, and The Wall Street Journal.David takes pride in his accomplishments and his success has allowed him to help non-profit organizations including A Wider Circle, S.O.M.E and Montgomery County Humane Society.When not working, David loves to spend time with his wife and 2 wonderful children.", "social": {"linkedin": "https://www.linkedin.com/in/davidjabramson/", "facebook": "https://www.facebook.com/DavidAbramsonRealtor", "instagram": "https://www.instagram.com/DavidJAbramson/", "twitter": "https://twitter.com/DavidJAbramson"}, "email": "david.abramson@compass.com", "title": "Realtor® ", "agent_phone_numbers": ["240-475-5001", "240-219-2422"], "office_phone_numbers": ["240-219-2422"]},
{"profile_url": "https://www.compass.com/agents/david-abrams/", "first_name": "David", "middle_name": "", "last_name": "Abrams", "image_url": "https://www.compass.com/m3/a911332e71b61370fe365bfc695fa0537bab8447/225x225.jpg", "desciption": "A native of the Washington DC Metropolitan area, David began his career as a top-producing sales consultant for a national remodeling company. After completing an M.B.A. at Emory University’s Goizueta Business School with a concentration in strategic marketing and working in Corporate Marketing for a Fortune 100 company, David returned to DC to pursue his passion for entrepreneurship and real estate.While born and raised in Montgomery County, MD, David has lived in Northern Virginia as well as several DC neighborhoods for the better part of 20 years, including Adams Morgan, the West End and Shaw, giving him a comprehensive knowledge of and true \"insider\" status in many of the neighborhoods that he serves. He currently resides in the Westmoreland Hills neighborhood in Bethesda, MD. David's clients consistently cite his tireless work ethic, total dedication to client needs, keen eye for detail and design, tested negotiation skills, and intimate knowledge of modern marketing techniques as highlights of his exceptional level of service.David has consistently been recognized as a top agent within Compass as well as one of the top agents in the Washington DC area by the Washingtonian and other industry publications. When he is not out scouring the market to find his clients their next opportunity, David enjoys spending time with his wife, Claire, who is also his business partner in Abrams Residential, their daughter, Dolly, son, Teddy, and their pup, Zoe.", "social": {}, "email": "da@compass.com", "title": "Realtor", "agent_phone_numbers": ["202-716-0660", "202-386-6330"], "office_phone_numbers": ["202-386-6330"]},
{"profile_url": "https://www.compass.com/agents/claire-welsh/", "first_name": "Claire", "middle_name": "", "last_name": "Abrams", "image_url": "https://www.compass.com/m3/032b023dc20716bced04ff2399286246996ba522.jpg", "desciption": "Claire Abrams, a Washington, D.C. native, knows the metropolitan area inside and out. She was born in Adams Morgan, grew up in the Del Ray section of Alexandria, and graduated from Georgetown University. She currently lives in Bethesda.Over the past 17 years, Claire has gained extensive experience in local real estate after working closely with some of the Washington area’s leading developers.Claire is totally client centered, believing that purchasing or selling a home is one of the most critical decisions an individual or family will ever make. She prides herself on applying the principles she learned as an ethics major at Georgetown to her everyday dealings with her clients. Her greatest satisfaction comes from knowing that she has helped secure the best deal possible for her clients.Claire's expertise doesn't end at the settlement table. She has a passion and eye for design, which helps her clients envision the greatest aesthetic potential for their spaces while at the same time enhancing their investment opportunities.", "social": {}, "email": "claire@compass.com", "title": "Realtor", "agent_phone_numbers": ["202-445-4432", "202-386-6330"], "office_phone_numbers": ["202-386-6330"]},
{"profile_url": "https://www.compass.com/agents/casey-aboulafia/", "first_name": "Casey", "middle_name": "", "last_name": "Aboulafia", "image_url": "https://www.compass.com/m/13/77f53014-b12e-404a-9b5c-30e20c80b635/300x300.webp", "desciption": "Casey’s clients appreciate her eye for detail, her friendly, collaborative approach, and her focus on the quantitative data that helps buyers and sellers make informed decisions. She has advocated for her clients in hundreds of real estate transactions since she became an agent in 2004, and she’s been immersed in the industry her whole life—practically from birth as Casey’s family has been involved in real estate investment since the early 1900s.  She recalls reading the real estate section of the Washington Post when she was just 10, and she became an investor herself in her early 20s, owning several rental properties in the area.As a full-time real estate agent, her extensive knowledge and shrewd, professional, energetic approach have placed her in the top echelon of agents in her area. With endless apps and overwhelming amounts of information online, she helps distill the needed information and streamline the process. One of the most frequent comments her clients make at closing is, \"This was so seamless - I kept waiting for something to get in the way given all the stories I hear, but everything went so smoothly!\" With so many years in the business behind her, the process she's honed makes the move simple.The daughter of an Air Force pilot and Montessori school teacher, Casey was born in Northern California, where her family is from, grew up in parts of the Metro DC area (first Oxon Hill, then Alexandria), and has lived in D.C. proper since 1999.  Before working in real estate, she followed her passion for international health and development, earning an MPH in Epidemiology from George Washington University and working in international public health for years. She is an entrenched member of her community, devoting time to public health and neighborhood organizations. In her free time, she especially loves to travel with her family, investigate new restaurants, kayak and scuba dive. After years living in Foggy Bottom and DuPont/Logan Circle, Casey now lives with her husband, Richard, and two children, in Cleveland Park, DC.View Casey's Video Bio", "social": {"facebook": "https://www.facebook.com/homeswithcasey/", "instagram": "https://www.instagram.com/homeswithcasey/"}, "email": "casey@homeswithcasey.com", "title": "Executive Vice President/Realtor®, GRI, CIPS, Green, ABR, SRS", "agent_phone_numbers": ["202-780-5885", "301-298-1001"], "office_phone_numbers": ["301-298-1001"]},
{"profile_url": "https://www.compass.com/agents/katrina-abjornson/", "first_name": "Katrina", "middle_name": "", "last_name": "Abjornson", "image_url": "https://www.compass.com/m/13/3e3cb2b0-81ff-4c6c-be6a-b8c52812999a/300x300.webp", "desciption": "The first year Katrina was in real estate, she was named Rookie of the Year. Since then, her exemplary performance as a Realtor has continued and been consistently proven to repeat and new clients alike. She enjoys affecting positive change in people’s lives and assisting in transactions that, for many, are among the most consequential financial decisions they will make. Most important to Katrina is the success of her clients, which she attributes to her organization, honesty, communication, and unflagging commitment. She is a skilled negotiator and an unrelenting advocate for her clients.She takes pride in upholding a high-standard of ethics, refuses to cut corners, and provides each client—from the first- time homebuyer to the experienced real estate investor—with the same level of committed service. Originally from Indiana, Katrina comes from a family of entrepreneurs. In college, she majored in  and international business and studied also overseas in Vienna and Innsbruck. After college, she worked for several well-known and influential trade associations. She continued to hone her business and negotiating skills while working in high-tech sales with one of the country’s largest technology companies.  In search of a way to use her extensive business expertise to help others, she made the move to real estate.Katrina has accumulated awards including:• America’s Top 1% Real Estate Agents® for Washington DC• Bethesda Magazine Top Producer• Compass #10 Individual Agent in the DMV Market• Compass Top Individual Producer• DC Metro Real Producers Top 500 and Top 1000• GCAAR Top Producer Gold and Silver Awards• Modern Luxury DC Real Estate Award Top Agents in DC• Virginia Living Magazine Real Estate All-Stars• Wall Street Journal Real Trends America’s Best Real Estate Professionals (Top 1.5% in the Nation)• Washingtonian Magazine Best Realtors• Washingtonian Magazine Top 100 RealtorsWhen Katrina and her husband, Erik, a retired lieutenant colonel in the US Marine Corps, are not spending time at their vacation home on Nantucket, they are either doing something adventurous or cooking at home while enjoying a glass of good wine. They also enjoy spending time their German Shepherds, Klaus and Otto, as well as their high-energy cat, Gunner and his new kitten brother, Jaeger. Strong proponents of animal welfare, Katrina and her husband are also supporters of the Montgomery County Humane Society and Middleburg Humane Society.  Katrina has lived in DC, MD and VA, and Katrina & Erik currently reside in Northern Virginia.Learn more about Katrinahere!", "social": {"facebook": "https://www.facebook.com/KatrinaAbjornson", "instagram": "https://www.instagram.com/katrina_abjornson/", "linkedin": "https://www.linkedin.com/in/katrinaschymik/?original_referer=https%3A%2F%2Fwww.compass.com%2F"}, "email": "katrina@compass.com", "title": "Senior Vice President, Realtor", "agent_phone_numbers": ["202-441-3982", "301-298-1001"], "office_phone_numbers": ["301-298-1001"]},
{"profile_url": "https://www.compass.com/agents/sherif-abdalla/", "first_name": "Sherif", "middle_name": "", "last_name": "Abdalla", "image_url": "https://www.compass.com/m3/94f2d57794d9c05d1a815e7ef281252ae85f09cd/300x300.jpg", "desciption": "Sherif Abdalla was born and raised in Northern Virginia where he attended Langley High School and then James Madison University, where he graduated with a degree in Computer Information Systems. After college, Sherif returned to the DC area to work in software sales before entering the restaurant business, where he successfully owned and managed six restaurants and nightlife venues over the course of ten years. It was through this experience that he learned the importance of building relationships and providing unrivaled customer service - skills that he leverages day in and day out for his clients as their Realtor today. Sherif knows that the decision to buy or sell is never an easy one, and feels honored to be part of such a significant milestone in his clients' lives.Throughout his real estate career he has worked with a variety of clients including, high-profile CEO's and local professional athletes, and has closed multi-million dollar transactions. In his spare time, Sherif is an avid DC sports fan with season tickets to the Wizards and Caps. He also coached in the Langley High School basketball program and enjoys participating in pick-up leagues in the area.", "social": {"linkedin": "https://www.linkedin.com/in/sherifabdalla/", "facebook": "https://www.facebook.com/SherifAndAli/", "instagram": "https://www.instagram.com/sherifandali/"}, "email": "sherif@compass.com", "title": "Executive Vice President | Member - Compass Sports & Entertainment Division", "agent_phone_numbers": ["703-624-5555", "703-310-6111"], "office_phone_numbers": ["703-310-6111"]},
{"profile_url": "https://www.compass.com/agents/sean-aalai/", "first_name": "Sean", "middle_name": "", "last_name": "Aalai", "image_url": "https://www.compass.com/m/13/c31c56ff-6ed0-4d6c-877b-57cb3408bd70/300x300.webp", "desciption": "Sean started his career in real estate in 2010, after a decade working as an account executive for two major DC-based publishers of building industry magazines. His past experience allowed him to gain expertise in the residential construction industry, and he soon became a top producing agent at Compass where his volume earned him the title of Vice President.Sean listens carefully to address the specific needs of each client and has earned rave reviews from first-time homebuyers as well as seasoned developers and investors. His clients appreciate his strong work ethic and attention to detail and rely on his market expertise to simplify the process of buying and selling. Sean’s goal is to maintain client relationships and to be a valuable resource for life, not just the duration of the transaction.Sean grew up in Montgomery County, Maryland, and attended the University of Maryland in College Park. He resides with his wife in Tenleytown, in one of the neighborhood’s five modernist houses designed in the 1940s by renowned DC architect Joseph Abel. Sean loves the residential feel of Tenleytown as well as the quaintness of its tree-lined streets.", "social": {}, "email": "sean@compass.com", "title": "Vice President", "agent_phone_numbers": ["202-552-9167", "301-298-1001"], "office_phone_numbers": ["301-298-1001"]},
{"profile_url": "https://www.compass.com/agents/2-rivers-team/", "first_name": "2", "middle_name": "Rivers", "last_name": "Team", "image_url": "https://www.compass.com/m/14/4ba7f7f5-c12b-48ed-b6ad-af145be8b775/300x300.webp", "desciption": "The 2 Rivers Team, inspired by the Potomac and Anacostia, which run through the 3 jurisdictions in the DMV, represents clients from every walk of life and every stage of living. Their extensive and deep local knowledge of the real estate market combined with a high-touch and hands-on work style is laser-focused on not just earning, but sustaining the trust of every single client. And it’s working. 70% of their current business is from past client referrals. The 2 Rivers Team business model is built on a simple principle: offer a better value than their competitors with a people-first philosophy built on data-driven decision making. One way the team accomplishes this is by offering home staging services to their clients, free of charge.From partnering with sellers to ensure they choose economically sensible home improvement projects that bear the highest ROI, to staging homes, to accompanying first-time buyers on marathon property tours, the 2 Rivers Team works tirelessly to represent every client’s individual needs and unique set of circumstances. Whether you are a first-time buyer, experienced seller, real estate developer, empty-nester, or looking to relocate in or out of the area, the 2 Rivers Team has the experience, network, and resources to serve any of your real estate needs.", "social": {"linkedin": "https://www.linkedin.com/in/randylivorsi/", "instagram": "https://www.instagram.com/the2riversteam/?hl=en", "facebook": "https://www.facebook.com/2riversteam/"}, "email": "2riversteam@compass.com", "title": "2 Rivers Team", "agent_phone_numbers": ["202-341-7530", "202-386-6330"], "office_phone_numbers": ["202-386-6330"]},
{"profile_url": "https://www.compass.com/agents/jennifer-angotti/", "first_name": "Jen", "middle_name": "", "last_name": "Angotti", "image_url": "https://www.compass.com/m/13/2484dc1c-d0ee-44d0-9461-8719cf101b2d/300x300.webp", "desciption": "Jen Angotti excels at helping buyers and sellers achieve their real estate dreams. She offers concise, realistic advice on how to navigate any real estate transaction. Her clients appreciate her attention to detail, willingness to answer questions and her patience.Jen’s innate curiosity has led to in-depth knowledge of all things new and interesting in the DMV. As a resident of NW DC and U St. Corridor for over ten years, Jen has experienced DC’s growth first hand.Jen is a member of the Arrow Group, a team of five professional realtors. Arrow Group works with a wide range of sellers, buyers, and investors. Arrow Group has over 40 years of combined experience and is known for consistently winning bidding wars for our buyers. Arrow Group provides clients with access to off-market properties and opportunities that most agents can't provide. The success of Arrow’s Group approach is evident in consistent annual sales of over $90 million and yearly nominations in The Best of Washingtonian.Client Testimonials★★★★★\"Jen came highly recommended  multiple friends who had worked with her on the buy and sale side, and the recommendations were spot-on. Jen is great. She knows the DC market; she is responsive and she always makes herself available; she gets to know her clients and figures out what they need and want; and she knows everyone you need to know in the house-buying process (inspectors, , etc.). We spent a long time working with Jen because of our very particular needs and wants list, as well as the hesitancy of being first-time buyers. She was patient and supportive throughout, never showing an ounce of frustration when we passed on home after home. She ended up finding us a private sale on our dream block. As first-time home-buyers, she walked us through the process and answered all our questions, helped us with all of the little things it takes to complete the sale, and we're thrilled to be in the house we bought. We have and continue to recommend her to all of our friends.\"- KP + JH★★★★★\"For anyone that is looking to make selling their home in DC an easy, painless and profitable experience I suggest working with Jen Angotti. Jen has now helped me sell two properties and I can say I’ve been thrilled with the process and the results. Not only was she knowledgeable regarding the market and pricing but she was the most hands-on  you can find. Jen made great recommendations regarding cost effective changes we could make prior to sale to increase the sale price. And she even served as the project manager for getting quotes and managing the work. I will be using Jen again when I’m buying or selling in the DMV and so should you!\"- C. Fairchild★★★★★\"Jen handled two sales & one purchase for my husband & I. She knows the DC market & gets things done right & fast. She handled a tough buyer for my condo & got that deal to close in time for our purchase. She fights for the best deal for her clients & goes the extra mile to make sure that happens.\"- M. Trimble★★★★★\"If you are looking for a realtor who knows the DC Market, look no further than Jen Angotti! We were first-time homebuyers, and Jen did a wonderful job walking us through a home-buying plan, connecting with lenders and taking us around to several different properties before we made an offer. We would highly recommend Jen if you are looking for a realtor in the D.C. area. Jen was very responsive throughout the whole process, kept us up to speed once we went under  and we always felt like she had our back and best interests in mind. Once we were ready to make an offer, Jen worked with us to draft the most competitive offer, which was accepted despite being outbid. After our  was ratified, Jen helped us get to the closing table and gracefully navigated some tricky and stressful issues with the development  - it made what is a very stressful process less stressful. We would definitely work with Jen again if looking to buy another .\"- T. Krogman", "social": {"instagram": "https://www.instagram.com/concretejungledc/?hl=en", "facebook": "https://www.facebook.com/concretejungledc/"}, "email": "jen.angotti@compass.com", "title": "Realtor®", "agent_phone_numbers": ["202-285-4238", "202-386-6330"], "office_phone_numbers": ["202-386-6330"]},
{"profile_url": "https://www.compass.com/agents/kelly-andrews/", "first_name": "Kelly", "middle_name": "", "last_name": "Andrews", "image_url": "https://www.compass.com/m/13/93fcddea-40bc-4ea1-bd40-d7014d3c4788/300x300.webp", "desciption": "Caring. Trendsetter. Dedicated.Kelly Andrews is a distinguished realtor with prestigious certifications, including ABR (Accredited Buyer Representative) and SFR (Short Sales and Foreclosure Resource). With a passion for excellence, she specializes in guiding first-time homebuyers through every step of their journey, skillfully navigating luxury real estate transactions, and helping sellers maximize their property value while ensuring a swift, profitable sale through innovative strategies.Beyond residential sales, Kelly is committed to empowering investors with strategic real estate opportunities that build long-term wealth. She understands that buying or selling a home is a life-changing experience, requiring expertise, dedication, and a deep understanding of the market. With her guidance, clients can embrace the process with confidence, knowing they have a trusted expert by their side to make the experience both exciting and seamless.", "social": {}, "email": "kelly.andrews@compass.com", "title": "Realtor®", "agent_phone_numbers": ["202-341-6003", "240-219-2422"], "office_phone_numbers": ["240-219-2422"]},
{"profile_url": "https://www.compass.com/agents/josh-andrew/", "first_name": "Josh", "middle_name": "", "last_name": "Andrew", "image_url": "https://www.compass.com/m3/84c44cc01db4f8d45123abc01913cee6e726aa3b/300x300.jpg", "desciption": "Josh is a lifelong Maryland resident, originally from the Eastern Shore and attended the University of Maryland. Josh has lived in the DC area for 15 years. Licensed in Maryland and DC, Josh has been overseeing the maintenance and leasing of properties for over 8 years and has become one of the top rental listing agents in the area as a result of his strong work ethic, dedication to customer service and professionalism.In his earlier years, he spent time in the construction trades as a carpenter and involved in general contracting with historic and custom homes on the Eastern Shore, which gives him valuable insight on the needs and care of properties.Josh is an avid sports fan and memorabilia aficionado, and when he's not managing and renting properties he can be found cheering on the Terps, Orioles, and Ravens. Josh currently lives in Gaithersburg.", "social": {"linkedin": "https://www.linkedin.com/in/josh-andrew-bb1a8135"}, "email": "josh.andrew@compass.com", "title": "Realtor®", "agent_phone_numbers": ["410-829-4477", "301-304-8444"], "office_phone_numbers": ["301-304-8444"]},
{"profile_url": "https://www.compass.com/agents/alvin-anderson/", "first_name": "Alvin", "middle_name": "", "last_name": "Anderson", "image_url": "https://www.compass.com/m/13/1e618127-84df-417d-8fce-e0a671c0346e/300x300.webp", "desciption": "Alvin is a real estate professional with extensive experience and an unmatched understanding of the Washington, DC, market. A proud Howard University graduate, Alvin has honed his expertise over years of working with buyers, sellers, and investors, earning a reputation for delivering exceptional results. Trained in the luxury real estate sector, Alvin offers a high level of service and precision that sets him apart, making him the go-to advisor for clients seeking top-tier representation.Alvin’s deep knowledge of the local market is complemented by his global perspective, shaped by a career as an international purser where he gained a unique appreciation for diverse cultures and architecture. Drawing on his background as the owner of a successful interior design firm in New York, Alvin excels at helping clients see the potential in every property. His experience working with real estate investors to identify high-yield opportunities and his ability to navigate the complexities of buying and selling homes makes him an invaluable asset to his clients.Committed to excellence and driven by a passion for real estate, Alvin’s approach is rooted in building trust and delivering results. Whether guiding a first-time buyer, negotiating for seasoned investors, or marketing luxury homes, Alvin’s attention to detail and dedication ensure every client’s goals are met with success. His involvement in community organizations and love for the city’s vibrant culture further reflect his investment in the place he calls home. Alvin is committed to helping his clients find the perfect home in this culturally rich and dynamic region.", "social": {}, "email": "alvin.anderson@compass.com", "title": "Realtor®", "agent_phone_numbers": ["917-370-9444", "202-386-6330"], "office_phone_numbers": ["202-386-6330"]},
{"profile_url": "https://www.compass.com/agents/jake-anderson/", "first_name": "Jake", "middle_name": "", "last_name": "Anderson", "image_url": "https://www.compass.com/m3/e97fc4690570aca72756fd0b805f20a155d4cf27/300x300.jpg", "desciption": "Jake consistently advocates for his clients' best interests while seeking creative, win-win outcomes for all parties involved. His approach to real estate is marked by integrity, trustworthiness and an unrelenting drive to serve his clients with excellence.Jake is a native Virginian who moved to Washington, D.C., nearly 25 years ago and soon embarked on several years in the non-profit sector.  He became a licensed real estate agent in 2015 and broker in 2018, closing well over $100 million in business.For the last 6 years, he’s been featured in Washingtonian Magazine as one of the region’s leading agents. He’s also a recipient of the GCAAR Gold Award every year it's been awarded and a REAL Trends top agent for 5 years running.Based on Capitol Hill, he specializes in single and multi-family housing across the cityJake lives with his wife and four daughters, enjoying a quiet moment and a siesta when he can get them.", "social": {"linkedin": "https://www.linkedin.com/in/jake-anderson-1a47b24/", "facebook": "https://www.facebook.com/jakeandersonDCrealestate/?eid=ARAu5jriZ5W2SmtfUgpD8k-HhQwVZfVVGNoddCEuob4aLAm-T3b1DW89Mvh6jtDh8YUi5maJixJiSnpG", "instagram": "https://www.instagram.com/jakeandersonrealestate/", "twitter": "https://twitter.com/jakeand123"}, "email": "jake@jakesellsdc.com", "title": "Realtor®", "agent_phone_numbers": ["202-669-7842", "202-545-6900"], "office_phone_numbers": ["202-545-6900"]},
{"profile_url": "https://www.compass.com/agents/carolyn-anderson/", "first_name": "Carolyn", "middle_name": "", "last_name": "Anderson", "image_url": "https://www.compass.com/m3/6770b98a212af6f170f8739e03d74ba23203fb3c/300x300.jpg", "desciption": "Carolyn is a second‐generation Realtor® who moved to the Washington area in 1998. Her passion  real estate was ignited at an early age—she grew up attending open houses and showings with her mom, where she witnessed first-hand just how meaningful it can be to help others find their place in the world. Prior to launching her own career in real estate, Carolyn was a teacher, counselor, and diplomat. Today, Carolyn leverages that background as she elevates the real estate process  both buyers and sellers alike. Carolyn's integrity, attention to detail, patience, and ability to negotiate make her an exceptional agent. Regardless of price point or location, Carolyn is a fierce advocate  her clients as she strives to bring their distinct vision to life.Carolyn completed her undergraduate education at Vanderbilt University and holds Masters degrees from American University and the University of Virginia. Her hobbies include hiking, baking, reading, and spending time with her family.AREAS SERVED: Northwest DC (Logan, Shaw, Dupont, Georgetown, Chevy Chase), Capitol Hill and the Waterfront, Northern Virginia (Arlington, Alexandria, Falls Church, Vienna/Oakton)", "social": {}, "email": "carolyn.anderson@compass.com", "title": "Realtor®", "agent_phone_numbers": ["202-320-9354", "703-266-7277"], "office_phone_numbers": ["703-266-7277"]},
{"profile_url": "https://www.compass.com/agents/maureen-andary/", "first_name": "Maureen", "middle_name": "", "last_name": "Andary", "image_url": "https://www.compass.com/m/14/f8c82cb1-97d9-4b20-ab9d-a5d3d37dafd2/300x300.webp", "desciption": "Maureen delivers. She explains markets, takes clients on driving tours, and shares stories about the community. Once you've found the perfect property, she'll work late hours to craft your best offer, closely managing the process through settlement.When listing properties, she takes great care to field estimates for improvement work, hires professional photographers and cleaners, and provides staging services. She does comprehensive comparable sale studies to inform her clients' pricing strategies, helping sellers land in the sweet spot and solicit multiple offers and ideal terms.In addition to standard transactions, she's dealt in bank-owned properties, short sales, condos, coops, new builds, and flips, all while using her tactical contract writing. When she's not working, Maureen is a musician and educator. Through her creative career, Maureen became well versed in many communities in the area. She is sensitive to her clients' needs and is a calm and compassionate listener and teacher.Maureen, a DC native, lives in Takoma, DC with her family. She's an active member of the Takoma Park community, teaching ukulele classes and hosting concerts in her home studio dubbed Takoma Ranch.", "social": {}, "email": "maureen.andary@compass.com", "title": "Realtor®", "agent_phone_numbers": ["202-320-2003", "301-298-1001"], "office_phone_numbers": ["301-298-1001"]},
{"profile_url": "https://www.compass.com/agents/tess-amolsch/", "first_name": "Tess", "middle_name": "", "last_name": "Amolsch", "image_url": "https://www.compass.com/m/13/c46c9e89-d6ca-43b3-9322-7050a1015ebe/300x300.webp", "desciption": "With a background in sales, real estate operations and interior design, Tess Amolsch has theideal experience and skills for a real estate agent. With 25 years of corporate sales experience,Tess learned the importance of listening to clients, understanding their needs and buildingtrust. After working in the corporate world, Tess became the director of operations forCompass DMV, where she developed a deep understanding of real estate listings, the contractsprocess and the benefits of Compass tools. After Covid, Tess moved into interior design anddiscovered she loves working in people’s homes. Real estate was the natural next step in hercareer. With an MBA from Johns Hopkins, Tess helps her clients navigate the sales process step by step, bringing an operational eye and keen organizational skills to every detail. With herexperience in interior design, she helps her clients see the vision and potential in each houseand understands what it takes to turn that house into a home. Tess lives in DC with herhusband, three children and dog, Pepper. In her spare time, she serves as deputy president ofMt. Pleasant Village, a nonprofit that helps seniors age in place.  Deeply committed to thecommunity she lives in, Tess also co-founded Neighbors Helping Neighbors during Covid to help provide food aid, Covid tests and masks to community members in need. Tess grew up inNorthern Virginia and has lived in DC since 1997. When she’s not watching her kids row crew or play field hockey, she is on a quest to find the best burger in town.", "social": {}, "email": "tessamolsch@compass.com", "title": "Realtor® | Licensed in DC", "agent_phone_numbers": ["202-494-3356", "202-386-6330"], "office_phone_numbers": ["202-386-6330"]},
{"profile_url": "https://www.compass.com/agents/albert-amar/", "first_name": "Albert", "middle_name": "", "last_name": "Amar", "image_url": "https://www.compass.com/m/13/c9d8a842-b7fb-4ba5-a33b-72cbfac166b1/300x300.webp", "desciption": "As a distinguished real estate associate broker, Albert excels at guiding families to discover their ideal homes. His genuine enthusiasm for meeting new clients and adept negotiation skills have cemented his reputation as a trusted advocate and industry leader. Clients consistently praise Albert for his strategic approach, grounded in thorough research, fair pricing, and transparent communication throughout the buying or selling journey. These qualities underscore his commitment to ensuring each transaction is not only seamless but also deeply satisfying.Beyond traditional brokerage, Albert is a savvy investor, actively managing his own real estate portfolio. His firsthand experience and insight into investment strategies empower him to expertly guide other investors in building and expanding their own real estate portfolios. This dual role as broker and investor enhances his understanding of market dynamics, making him an invaluable resource for those looking to maximize their real estate investments.Albert's dedication and expertise are well-recognized, earning him accolades as a top agent for several consecutive years, alongside prestigious awards from the Greater Capital Area Association of Realtors (GCAAR) and Montgomery County. Fluent in French, Spanish, and Darija, Albert’s ability to communicate effectively with a diverse clientele enhances his capacity to build strong, lasting relationships.Beyond his professional achievements, Albert is a devoted family man, married and the proud father of two daughters and a lively Shih Tzu. His personal interests, which include playing tennis, riding motorcycles, flying planes, and traveling internationally, reflect the same vigor and zest for life that he brings to his work.Albert Amar remains unwaveringly dedicated to serving the real estate needs of his community, delivering exceptional results with integrity, professionalism, and a heartfelt commitment to excellence. Whether navigating complex negotiations or celebrating a family’s new home, Albert’s goal is to provide unparalleled service and satisfaction.Albert Amar stands as a pillar of excellence in the real estate industry within Washington DC, Maryland, and Virginia—a testament to his profound connection to the area he has called home since 2002. Drawn by the vibrant, cosmopolitan allure of the nation's capital and its surrounding lush landscapes, Albert’s affinity for the region fuels his passion for real estate.", "social": {}, "email": "albert.amar@compass.com", "title": "Associate Broker | Licensed in DC, MD & VA", "agent_phone_numbers": ["240-643-1417", "301-304-8444"], "office_phone_numbers": ["301-304-8444"]},
{"profile_url": "https://www.compass.com/agents/manuel-alvarez/", "first_name": "Manuel", "middle_name": "", "last_name": "Alvarez", "image_url": "https://www.compass.com/m/13/467f3ee5-6eeb-4801-8eb9-21fb170e6d31/300x300.webp", "desciption": "Where real estate meets artistry! Meet Manuel, our seasoned Executive Team Leader with over two decades of experience. He doesn’t just facilitate transactions; he orchestrates each transaction to deliver outstanding results. With a refined approach, Manuel skillfully navigates the intricacies of the market, ensuring every client feels valued and understood.As a Commercial Broker, Manuel is dedicated to exceeding sales targets and delivering exceptional service. He collaborates with a talented team to develop innovative sales strategies, implement targeted marketing campaigns, and cultivate strong customer relationships—all aimed at making each transaction seamless and feasible.Currently pursuing a Master's degree at Johns Hopkins, Manuel aspires to be the James Bond of real estate—mastering complexities with finesse. His academic journey reflects a deep commitment to understanding the industry's nuances, empowering him to transform intricate information into insightful conversations that benefit clients.For a real estate experience that flows effortlessly, entrust your dreams to Manuel and his team. They offer top-tier representation.", "social": {"linkedin": "https://www.linkedin.com/in/manuel-alvarez-96645629/", "facebook": "https://www.facebook.com/manuelrealestate", "twitter": "https://twitter.com/ManuelA52016227"}, "email": "manuel.alvarez@compass.com", "title": "Principal | Alvarez Real Estate Group", "agent_phone_numbers": ["443-643-8678", "410-886-7342"], "office_phone_numbers": ["410-886-7342"]},
{"profile_url": "https://www.compass.com/agents/jazzmine-alston/", "first_name": "Jazzmine", "middle_name": "", "last_name": "Alston", "image_url": "https://www.compass.com/m/13/60d44d1c-a139-4b4d-84b0-5bdae8f8f83c/300x300.webp", "desciption": "Jazzmine Alston is a highly accomplished Realtor with a deep passion for helping individuals and families achieve their dreams of homeownership. Born in NC and raised in the DC area, Jazzmine has a unique understanding of the local real estate markets, and specializes in Raleigh North Carolina and surrounding counties, as well as the Washington, DC area.With over a decade of experience in the human resource field, Jazzmine brings a wealth of knowledge and expertise to the table. She has a proven track record of success and has consistently been recognized for her exceptional service and results-driven approach.Jazzmine is committed to providing her clients with personalized, attentive service, and works tirelessly to ensure that their home buying experience is as smooth and stress-free as possible. She is dedicated to staying up-to-date with the latest market trends and developments and leverages her knowledge and expertise to help her clients make informed decisions.Contact her today. Jazzmine looks forward to the opportunity to serve you and anyone you know with their real estate needs!Licensed in DC, NC", "social": {}, "email": "jazzmine.alston@compass.com", "title": "Realtor®", "agent_phone_numbers": ["336-254-4391", "202-386-6330"], "office_phone_numbers": ["202-386-6330"]},
{"profile_url": "https://www.compass.com/agents/mouhanad-al-rifay/", "first_name": "Mouhanad", "middle_name": "Al", "last_name": "Rifay", "image_url": "https://www.compass.com/m/13/2e076c7b-c000-4559-980b-016cc60a7c02/300x300.webp", "desciption": "Mouhanad, a long-time resident of the Washington, DC metropolitan area, is a Syrian-American humanitarian, writer, and award-winning documentary filmmaker. After completing his graduate studies at Harvard University’s Center for Middle Eastern Studies in 2021, he decided to pursue his passion in Real Estate. He loves helping first-time home buyers find their homes in the national capital region. He is currently licensed in Maryland and Washington, DC. As a founding member of theBarnes Groupat Compass, Mouhanad has the resources to serve buyers and sellers throughout the DMV area. Mouhanad, a native Arabic speaker, is a proud son of Syrian political asylees and is a strong supporter of the global struggle for equality and human rights. In his free time you will find him reading, gardening, and spending time with his dog, Biscuit, rescued in 2020.", "social": {"linkedin": "https://www.linkedin.com/in/mouhanadalrifay", "instagram": "https://www.instagram.com/sherylbarnesgroup/"}, "email": "mouhanad.alrifay@compass.com", "title": "Realtor®", "agent_phone_numbers": ["301-633-5314", "301-298-1001"], "office_phone_numbers": ["301-298-1001"]},
{"profile_url": "https://www.compass.com/agents/christine-allocca/", "first_name": "Christine", "middle_name": "", "last_name": "Allocca", "image_url": "https://www.compass.com/m/13/b67408c3-34d4-4a6d-8d8f-8dbd6d5f8c16/300x300.webp", "desciption": "I’m Christine Allocca, a dedicated Realtor with a purpose: to turn your dream lifestyle into a reality.  I've sold over $30 million in the last 2 years, helping 42 families buy or sell their home along the way.  Importantly, my buyer clients usuallydid not have to pay the highest price, even against as many as 22 offers!  My clients who have sold their homes in this very different market have been armed with the best strategies to leave no money on the table, and to keep their sale together.  I'm an expert negotiator, and I'm proud thatNorthern Virginia Magazine,Washingtonian, andDC Luxury Magazinehave all named me as one of the DC area's Top Agents in 2019-2023.  More important to me than any success I’ve had in my career, though, is the impact I have on the lives of my clients. With over a decade of real estate experience to draw from, I arm every client with the knowledge they need to navigate such a momentous financial milestone with confidence. The outcome? A seamless, successful life transition—and the results to show for it.I make a habit of cultivating good relationships with my colleagues, which directly benefits my seller clients when it’s time to get up-to-the-minute info about the market and the competition.  Just as comfortable in the city as I am in the suburbs, I routinely leverage my deep connection with the Northern Virginia and DC areas to match buyer clients with their ideal neighborhood that’s near transportation, work, schools, and nightlife. I grew up on the Virginia side of GREAT FALLS and have lived in the Logan Circle, Adams Morgan and Dupont Circle neighborhoods in DC. I truly know what it means to work, live, and play in the DMV.  Fittingly, this first-hand knowledge translates directly into crafting location-driven investment strategies that build wealth for my clients.When I'm not helping clients buy or sell their dream home, you can find me posing in Savasana at a local yoga studio, cozying up with a great mystery novel, or biking the WOD trail on my new Trek hybrid bike. As a regular meditator, I'm interested in balance and well-being, and I seek to infuse both into my everyday life.Here’s a glimpse into a few of the (other) things that make me who I am:Food I can’t live without: CheeseFavorite area restaurant: King Street Oyster BarGo-to cocktail: Slightly dirty Kettle One martini with 3 blue cheese olivesDream vacation spot: Hiking Glacier National ParkWhat I love most about my job: My clients' smile after I've negotiated their dealSecret weapon: Healthy dose of gratitudeClient Testimonials★★★★★\"Christine is awesome! She is attentive and responsive. She can sympathize and has a ton of patience. We looked at listings across Loudoun and Prince William Counties and our time was not wasted. Her expertise showed with her comments and predictions, which were on point! She truly knows her stuff!\"★★★★★\"Christine was my first pick when choosing a realtor on . She was the first to respond through my options , the first to answer all my annoying questions as a first time home buyer , the first to help us find our perfect home. She never missed a call or texts when asking asking of questions of concerns, walk us through the long process step  step so we can understand without any doubt. Christine was focus on us finding the perfect home not trying to make any sale. I would recommend her to anyone as you will experience nothing but reliable , professional, customer focus service as a realtor.\"★★★★★\"Simply put Christine is Awesome!!! She had data and defined strategy to sell our home and most importantly had a very positive energy that clearly conveyed that helping people buy/sell homes is more than just a business for Christine. We would unreservedly recommend Christine to anyone who wants a dedicate real estate professional that is singularly focused on her client's needs.\"★★★★★\"Christine was simply a joy to work with! From the initial phone call I knew she was a great fit for us! Her presentation was more professional and put together than I have ever seen! She is easy-going and also extremely knowledgeable. She made a very stressful life experience very easy!\"★★★★★\"Most recently, Christine assisted me in the sale of my D.C. condo, obtaining successful results in a very short time frame. She is both professional and friendly, and went above and beyond to make my experience as seamless as possible. In short, if you are looking for an agent who will tirelessly advocate on your behalf, while patiently walking you through the sale/purchase process, engage Christine.\"★★★★★\"Christine is everything you could want in your Realtor and more. She goes above and beyond typical duties. She advertised our property in the Washingtonian, helped us get ready for the open house, hired cleaners, and gave us an excellent referral for a handyman. She keeps a level head during  negotiations. She is well versed on the nuisances of selling a home in Washington DC.  We highly recommend Christine. It was a pleasure working with her.\"See what my clients are saying about me!", "social": {"instagram": "https://www.instagram.com/christine.allocca/", "linkedin": "https://www.linkedin.com/in/christine-allocca"}, "email": "christine.allocca@compass.com", "title": "Associate Broker", "agent_phone_numbers": ["703-795-3016", "703-783-7485"], "office_phone_numbers": ["703-783-7485"]},
{"profile_url": "https://www.compass.com/agents/peter-allison/", "first_name": "Peter", "middle_name": "", "last_name": "Allison", "image_url": "https://www.compass.com/m/14/6aef6886-30b9-4709-8788-309b598b9ead/300x300.webp", "desciption": "An East Bethesda resident and 4th generation “Washingtonian,” Peter Allison has a thorough understanding of the local trends comprising the DC Metro Area. His extensive knowledge, expertise, and attention to detail positions him to provide his clients with a truly impressive real estate experience. He is very astute and highly skilled in negotiating the acquisition of various types of residential properties such as: forever homes, value-add homes, investments, new construction, and luxury homes. In helping his clients find or sell their homes, Peter clearly distinguishes himself with a proven process, an intense work ethic, and a performance-driven mentality.Known for his thoughtful guidance and vision, Peter takes the time to deeply educate and advise his clients on current market conditions, potential challenges, and any home defects that may affect the buying or selling decisions.  Peter prioritizes building long-term relationships with his clients based on active listening, continuous communication, and trust.   His ultimate goal is to assist his clients in maximizing their desired outcomes by providing an insightful, value-driven process that surpasses their highest expectations.Peter prides himself on being a dedicated husband and real estate partner to his wife, Brittany, and father to their two sons, Axel and Ace.  Peter is an avid golfer and enjoys spending time in Naples, FL and Bethany Beach.", "social": {}, "email": "peterallison@compass.com", "title": "Realtor®", "agent_phone_numbers": ["301-996-7125", "301-298-1001"], "office_phone_numbers": ["301-298-1001"]},
{"profile_url": "https://www.compass.com/agents/darrell-allison/", "first_name": "Darrell", "middle_name": "", "last_name": "Allison", "image_url": "https://www.compass.com/m3/f935b2fbd26b10a78ee5bfdb7cfea2b01a7bb299/300x300.jpg", "desciption": "", "social": {}, "email": "darrell.allison@compass.com", "title": null, "agent_phone_numbers": ["202-669-3218", "202-386-6330"], "office_phone_numbers": ["202-386-6330"]},
{"profile_url": "https://www.compass.com/agents/brittany-allison/", "first_name": "Brittany", "middle_name": "", "last_name": "Allison", "image_url": "https://www.compass.com/m/14/d016f002-4a31-4e5f-b2e3-c37ccfa906cf/300x300.webp", "desciption": "By harnessing a distinct blend of marketing prowess, local expertise, persistence, and just the right touch of humor, Brittany Allison creates unforgettable experiences for each client she serves.A lifelong Washingtonian, Brittany offers unparalleled insight into many of the area’s most desirable neighborhoods, including Bethesda, Chevy Chase, Potomac, Georgetown, and Logan Circle, to name just a few. Her experience selling 300+ homes has resulted in her keen negotiation and consulting skills, providing indispensable in advocating for her clients today. Her tenacity combined with her passion for guiding people through the biggest milestones of their lives make Brittany both an exemplary agent and lifelong friend.When it comes to her approach to real estate, Brittany believes in a high-tech, high-touch model above all. She leverages the proprietary technology of Compass to empower her clients to more swiftly and seamlessly navigate the home search and sell process, while remaining a trusted advisor at each step of the way. From first time home buyers, to investors, to those looking to downsize, Brittany finds creative solutions to bring every vision to life.When she’s not working, you can find Brittany making the most of her time with her husband and two boys or helping to improve her community as a resident of East Bethesda.", "social": {"instagram": "https://www.instagram.com/homewithbrittanyallison/", "facebook": "https://www.facebook.com/BrittanyAllisonRealtor/"}, "email": "brittany.allison@compass.com", "title": "Senior Vice President", "agent_phone_numbers": ["301-461-0084", "301-298-1001"], "office_phone_numbers": ["301-298-1001"]},
{"profile_url": "https://www.compass.com/agents/alliance-home-group/", "first_name": "Alliance", "middle_name": "Home", "last_name": "Group", "image_url": "https://www.compass.com/m/14/760f336d-1317-4b16-aa70-175204e055d6/300x300.webp", "desciption": "", "social": {}, "email": "alliancehomegroup@compass.com", "title": null, "agent_phone_numbers": ["703-266-7277"], "office_phone_numbers": ["703-266-7277"]},
{"profile_url": "https://www.compass.com/agents/addi-aliu/", "first_name": "Addi", "middle_name": "", "last_name": "Aliu", "image_url": "https://www.compass.com/m3/00bf36351080946d80787e62fe1bcbccf710d279/300x300.jpg", "desciption": "With over 10 years of Real Estate experience and having placed keys in the hands of nearly 2000 clients, Addi is no novice when it comes to homes in the DMV. Being a DC native and enthusiast, she prides herself on having a wealth of market knowledge about the area, coupled with the luxury of having seen the city evolve over time. Addi has an ability for simplifying the real estate process and customizing each client's experience to fit their wants and needs seamlessly.Addi earned her Bachelor of Degree in Business Management from Hampton University in 2010, which lends tremendously to her ability to negotiate and market for her clients. In her free time, Addi enjoys traveling, playing with her dogs Missy and Hazel, working out and spending quality time with her close friends and family.", "social": {}, "email": "addi.aliu@compass.com", "title": "Realtor® licensed in MD", "agent_phone_numbers": ["301-323-3397", "202-386-6330"], "office_phone_numbers": ["202-386-6330"]},
{"profile_url": "https://www.compass.com/agents/michael-alderfer/", "first_name": "Michael", "middle_name": "", "last_name": "Alderfer", "image_url": "https://www.compass.com/m3/07b08e7227ecade1a9340d171435211e64ed7bea.jpg", "desciption": "Buying or selling a home is a big decision, but that doesn't mean it has to be a stressful one. Michael guarantees that he will do everything possible to make this an enjoyable process while ensuring all of your needs are met promptly and professionally. Michael will fight for your interests and use his local expertise to give you the best possible experience selling your home. As an agent, he promises to be loyal, trustworthy, and honest with all of his clients to help them find their perfect home. Working with an agent means you get an entire company dedicated to selling your home for the best possible value: while Michael is focused on guiding you through a successful transaction. Buying a home is one of the most rewarding and important things he has ever experienced, and Michael believes that everyone should have someone to rely on during their real estate transaction.", "social": {"linkedin": "https://www.linkedin.com/in/michael-alderfer-3a54412/", "facebook": "https://www.facebook.com/MichaelAlderferCompass"}, "email": "michael.alderfer@compass.com", "title": "Realtor® Licensed in DC, MD & VA", "agent_phone_numbers": ["202-276-4293", "202-386-6330"], "office_phone_numbers": ["202-386-6330"]},
{"profile_url": "https://www.compass.com/agents/farouk-al-alousi/", "first_name": "Farouk", "middle_name": "Al", "last_name": "Alousi", "image_url": "https://www.compass.com/m/13/fb360062-bdaf-48e9-a183-1af667c048b0/300x300.webp", "desciption": "", "social": {}, "email": "farouk.alalousi@compass.com", "title": "Realtor® licensed in DC", "agent_phone_numbers": ["703-673-8657", "703-310-6111"], "office_phone_numbers": ["703-310-6111"]},
{"profile_url": "https://www.compass.com/agents/reza-akhavan/", "first_name": "Reza", "middle_name": "", "last_name": "Akhavan", "image_url": "https://www.compass.com/m3/905f04b8ed4940bdc83d58f5fed11414ffb6bec1/300x300.jpg", "desciption": "Through his comprehensive and intimate knowledge of the Greater DC real estate market, Reza Akhavan provides valuable insights to his clients.  Known as the “The Go to Agent” for one of his favorite neighborhoods and where he resides is the community of Petworth. Appreciated for his extra effort and attention that produces outstanding results, Reza constantly takes every measure to ensure that his clients successfully accomplish their personal real estate goals.As a specialist in the Acquisition and  of Residential Properties and Rentals in all price points; Reza offers exceptional representation and ensures that each client is provided with the expertise that meets their personal objectives. His main goal is to help each client make educated choices about their investments and takes great care to advise his clients with valuable analytical information and an informed and comprehensive understanding of the current real estate market.  He delivers impressive results  knowing the important questions to ask upfront.  His clients know him to be genuine, honest and full of integrity.  In taking every measure to help his clients successfully find the home that they will fully cherish, he is very skilled in finding solutions that result in a positive outcome.Going above and beyond is all part of Reza’s special care and attention that makes all the elements come perfectly together.  He is always extremely attentive, accessible and responds promptly. His attention to detail, consistent follow through and determination to indulge his clients with first class service sets his apart.  Reza ultimately ensures that each client receives an exceptional real estate experience and takes every measure to accomplish their real estate goals.Contact Reza to serve you and your personal real estate interests.", "social": {}, "email": "reza.akhavan@compass.com", "title": "Realtor®", "agent_phone_numbers": ["202-309-0073", "202-386-6330"], "office_phone_numbers": ["202-386-6330"]},
{"profile_url": "https://www.compass.com/agents/steve-agostino/", "first_name": "Steve", "middle_name": "", "last_name": "Agostino", "image_url": "https://www.compass.com/m/13/f7988282-9782-4626-b99d-fa1ff4981157/300x300.webp", "desciption": "Since 1991, Steve Agostino has brought clients his special expertise in making homes “ready for sale”.  Steve sweats the details so you don’t have to!  Whether it’s helping you pick just the right color for your  door, performing an in-depth study of sales trends, or giving careful analysis of the forty or so pages that make up today’s sales contracts, Steve will manage all the details for you, ensuring the best results.  A hands-on personality, he will be with you every step of the way.  As a lover of his community and the outdoors, Steve volunteers with Friends of Lafayette Park, works with rescue dogs, and supports involvement in local environmental causes.  He’s also an avid cyclist which gives him an opportunity to see the city and suburbs up close and personal.  With decades of living and selling in Washington DC, Steve has a solid base of experience that backs his confident yet careful approach.Client Testimonials★★★★★We’ve known the Taylor Agostino Group for years, but it wasn’t until I bought and sold a home with Steve and JoJo that I realized how exceptional they truly are. They guided me through smart pre-sale updates, timed the market perfectly, and helped me navigate over 10 offers to sell for $240k above asking—all while finding the perfect next home for my family. Their patience, honesty, and integrity stood out at every step. Even after closing, they’ve continued to be a trusted resource. I hope I’ll be in my new home for many, many years to come, but if I ever need to make a move, Steve and JoJo will be the first people I call. It’s a no-brainer.Elizabeth Field★★★★★We just sold our home of 33 years with the superb expertise of Steve Agostino and his team. Every step of the way Steve was there for us, taking out the stress out of a difficult time. The stress came in unexpected waves: a slow spot in the market - Steve repositioned the marketing - we found an avid buyer but plumbing and floor joists failed inspection (90 years old house) - Steve found superb plumbers and carpenters to fix without delaying closing - then the closing! - Steve was there to explain and monitor the settlement agent. Lots of work for Steve and a reassuring process for us.Patti Absher", "social": {}, "email": "steve.agostino@compass.com", "title": "Realtor", "agent_phone_numbers": ["202-321-5506", "301-298-1001"], "office_phone_numbers": ["301-298-1001"]},
{"profile_url": "https://www.compass.com/agents/kyra-agarwal/", "first_name": "Kyra", "middle_name": "", "last_name": "Agarwal", "image_url": "https://www.compass.com/m/13/24622e3c-2dbf-4509-8361-ba2d57866159/300x300.webp", "desciption": "Kyra began her real estate career in Washington DC and has quickly become a prominent member of the industry. Born in the Silicon Valley and raised between Dubai and India, she brings an innovative approach to the core tenets of the real estate business.A proud resident of Logan Circle, Kyra takes great pride in serving as a trusted advisor for her clients, helping them navigate the complexities of the real estate market while striving to create enduring relationships. With a commitment to transparency, she provides insight and expertise to each transaction and has extensive knowledge of ground up new construction.Her passion for the industry fuels her tireless work ethic, and her keen eye for design comes from having worked in the forefront of luxury development projects at a prominent DC development firm. Recognized as a firm and highly effective negotiator, she offers a wealth of knowledge and leverages her industry relationships to best serve her clients.", "social": {"instagram": "https://www.instagram.com/kyraerikaagarwal/?hl=en"}, "email": "kyra.agarwal@compass.com", "title": "Vice President", "agent_phone_numbers": ["424-666-9202", "202-386-6330"], "office_phone_numbers": ["202-386-6330"]},
{"profile_url": "https://www.compass.com/agents/nicholas-africano/", "first_name": "Nicholas", "middle_name": "", "last_name": "Africano", "image_url": "https://www.compass.com/m/13/2912e61c-024c-416f-bb0a-db8448fbfcfb/300x300.webp", "desciption": "In delivering his signature personal and responsive representation, Nick Africano ensures that his client’s best interests are always of the utmost importance.  As an intricate member of The HomeFront Group, he is appreciated for his integrity and transparency that he exhibits in each transaction.  Nick clearly distinguishes himself with proven results while implementing a fully engaging, fun, and truly impressive real estate experience.In personally working with each client and upon understanding their specific priorities, Nick then diligently aligns and applies himself in order to accomplish their real estate goals.  He is extremely diligent in covering every angle in researching and providing his clients with the critical information needed to make thoughtful and balanced decisions.  Nick exhibits extensive knowledge, skill, and resourcefulness and takes great care to educate and advise his clients with an informed and comprehensive understanding of the current real estate market.  Whether it’s working with first-time buyers, reviewing the technical points of the transaction, doing diligence on issues cited in the title report, or analyzing current market data, Nick is extremely passionate about seeing that his clients’ needs are thoroughly attended to.Through Nick’s deep commitment to his clients and the valued relationships developed with them, he exhibits genuine care and dedication.  He adds value and a rich experience at every interaction.  Nick is very thorough in providing constant communication about each important detail of the transaction and is always extremely attentive, accessible, and responds promptly to his clients.  Recognized for his highly personal and responsive representation, Nick is a true advocate who is fully dedicated to achieving his clients’ real estate goals.", "social": {"linkedin": "https://www.linkedin.com/in/nicholas-africano-682b5a9b/", "facebook": "https://www.facebook.com/HFnafricano/"}, "email": "nick.africano@compass.com", "title": "Realtor®", "agent_phone_numbers": ["703-851-6201", "703-229-8935"], "office_phone_numbers": ["703-229-8935"]},
{"profile_url": "https://www.compass.com/agents/advisory/", "first_name": "Advisory", "middle_name": "", "last_name": "", "image_url": "https://www.compass.com/m/13/57f08fb1-35f1-49c6-ab8e-f2c86e6c6c81/300x300.webp", "desciption": "ADVISORY is a curated group of some of the top real estate professionals at Compass.  With diverse backgrounds and decades of experience, the agents of ADVISORY guide clients with ease from start to finish.  The agents of ADVISORY have sold more than $2 Billion of property including over $227 Million in 2024, making ADVISORY the #1 team at Compass in the Washington Metro Area.  ADVISORY serves a broad range of clientele throughout Northern Virginia, Washington DC, and Maryland.  Agents of ADVISORY operate in a supportive and collaborative environment while always prioritizing clients’ best interests. Clients of ADVISORY receive personalized experiences that are grounded in trust, integrity, and deep local market knowledge.", "social": {}, "email": "advisory@compass.com", "title": null, "agent_phone_numbers": [], "office_phone_numbers": []}
]